The design option id.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2011
 Syntax
  C#
public ElementId DesignOptionId { get; }
  Visual Basic
Public ReadOnly Property DesignOptionId As ElementId
	Get
  Visual C++
public:
property ElementId^ DesignOptionId {
	ElementId^ get ();
}
 See Also
  ElementDesignOptionFilter Class
  Autodesk.Revit.DB Namespace